# DegreeR Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..DegreeR Property
SymbolTypeId Class See Also
---
Symbol °R, indicating unit Rankine.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DegreeR { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DegreeR As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DegreeR {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace